{
    "FCF yield": {
        "definition": "Free Cash Flow (FCF) Yield measures the free cash flow generated by a company relative to its market capitalization. It shows how much cash a company produces per dollar invested by shareholders.",
        "importance": "FCF Yield is important because it reflects the company’s ability to generate cash that can be used for dividends, debt repayment, or reinvestment. A higher FCF Yield may indicate undervaluation or strong financial health, making it attractive to investors."
    },
    "NOPAT": {
        "definition": "Net Operating Profit After Taxes (NOPAT) is the company’s operating profit after adjusting for taxes but excluding the impact of debt financing. It reflects the profit generated from core operations.",
        "importance": "NOPAT is important because it isolates operating performance without the distortion of financing or non-operating items. It helps investors assess the true profitability of the company’s operations."
    },
    "ROIC": {
        "definition": "Return on Invested Capital (ROIC) measures how effectively a company uses its invested capital to generate profits. It is the ratio of NOPAT to total invested capital.",
        "importance": "ROIC is crucial because it shows the efficiency and profitability of a company’s capital investments. A higher ROIC compared to the cost of capital suggests value creation for shareholders."
    },
    "ReinvRate": {
        "definition": "Reinvestment Rate (ReinvRate) indicates the proportion of earnings that a company reinvests back into the business rather than distributing as dividends.",
        "importance": "The reinvestment rate is important for understanding a company’s growth strategy. High reinvestment can signal aggressive growth plans, while low reinvestment might indicate maturity or focus on returning capital to shareholders."
    },
    "D/E": {
        "definition": "Debt-to-Equity Ratio (D/E) compares a company’s total debt to its shareholders’ equity, indicating the relative proportion of debt financing.",
        "importance": "The D/E ratio is important because it helps investors assess financial risk and leverage. High leverage may increase returns but also raises bankruptcy risk, while low leverage indicates conservative financing."
    },
    "ICR": {
        "definition": "Interest Coverage Ratio (ICR) measures a company’s ability to meet its interest payment obligations with its operating earnings.",
        "importance": "ICR is important as it indicates financial stability and creditworthiness. A higher ratio means the company comfortably covers interest expenses, reducing default risk."
    },
    "OMS": {
        "definition": "Operating Margin (OMS) is the percentage of revenue remaining after covering operating expenses, reflecting operational efficiency.",
        "importance": "Operating margin is key for investors to understand profitability from core business activities. Higher margins often indicate better cost control and competitive advantage."
    },
    "EV/OCF": {
        "definition": "Enterprise Value to Operating Cash Flow (EV/OCF) ratio compares the total valuation of a company (EV) to its operating cash flow.",
        "importance": "This metric helps investors assess if a company is undervalued or overvalued relative to the cash it generates from operations, providing a cash-flow based valuation perspective."
    },
    "EVA/InvCap": {
        "definition": "Economic Value Added (EVA) to Invested Capital ratio measures the value created by a company above its cost of capital, relative to invested capital.",
        "importance": "EVA/InvCap is important as it indicates whether a company is generating returns exceeding its capital costs, signifying real economic profit and value creation for shareholders."
    }
}